fn main() {
    println!("Hello, world!");
}

//
fn test1() {
    {
        let r;               // ---------+-- 'a
        {                           //          |
            let x = 5;        // -+-- 'b  |
            r = &x;                 //  |       |
        }                           // -+       |
        println!("r: {}", r);       //          |
    }                               // ---------+
}
// 生命周期注解语法
//&i32        // 引用
//&'a i32     // 带有显式生命周期的引用
//&'a mut i32 // 带有显式生命周期的可变引用


//生命周期省略规则
//函数或方法的参数的生命周期被称为 输入生命周期（input lifetimes）
//返回值的生命周期被称为 输出生命周期（output lifetimes）。
//静态生命周期